Revit 2027 API
IFCUserDefinedProperty.DataType Property
 The data type of the property.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DataType { get; set; }
Public Property DataType As String
	Get
	Set
public:
property String^ DataType {
	String^ get ();
	void set (String^ value);
}
member DataType : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCUserDefinedProperty Class
Autodesk.Revit.DB Namespace